phygeonet-master/case3/TemplateCase-0.075/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.492203
-0.472113
-0.452023
-0.431933
-0.411843
-0.391753
-0.371663
-0.351573
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.502244
-0.506726
-0.511188
-0.515617
-0.519999
-0.524321
-0.528569
-0.532728
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.502244
0.506726
0.511188
0.515617
0.519999
0.524321
0.528569
0.532728
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
